Revit 2027 API
FabricationNetworkChangeService.GetStraightsThatWereNotChanged Method
 Gets the set of fabrication part straights that were not changed due to either there was no corresponding part in the service or the size was out of range.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetStraightsThatWereNotChanged()
Public Function GetStraightsThatWereNotChanged As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetStraightsThatWereNotChanged()
member GetStraightsThatWereNotChanged : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
Remarks
 This set of element identifiers is only available after the ChangeService or ChangeSize method has been invoked, and returns FabricationNetworkChangeServiceResult::Enum::PartialFailure.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace